---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetX
source: html/204c92b1-2689-3f13-b1e2-82b63acae2fb.htm
---
# Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".